@BeryJu thanks for fixing, I can approve that it is working now as intended

```
module.authentik.authentik_service_connection_kubernetes.local: Refreshing state... [id=da9c1c87-b5d6-48eb-9f37-91fd0a1892b5]
module.authentik.authentik_provider_proxy.prometheus: Refreshing state... [id=6]
module.authentik.authentik_provider_proxy.longhorn: Refreshing state... [id=1]
module.authentik.authentik_provider_proxy.traefik: Refreshing state... [id=5]
module.authentik.authentik_provider_proxy.esphome: Refreshing state... [id=4]
module.authentik.authentik_provider_proxy.alertmanager: Refreshing state... [id=7]
module.authentik.authentik_provider_proxy.goldilocks: Refreshing state... [id=2]
module.authentik.authentik_provider_proxy.scanservjs: Refreshing state... [id=3]
module.authentik.authentik_source_oauth.google: Refreshing state... [id=google]
module.authentik.authentik_application.prometheus: Refreshing state... [id=prometheus]
module.authentik.authentik_outpost.prometheus: Refreshing state... [id=32a759b7-f2b9-4fe2-bebf-523300e4165f]
module.authentik.authentik_outpost.longhorn: Refreshing state... [id=66c19be6-ec00-4712-947f-be7de1d01cc1]
module.authentik.authentik_application.longhorn: Refreshing state... [id=longhorn]
module.authentik.authentik_application.scanservjs: Refreshing state... [id=scanservjs]
module.authentik.authentik_outpost.scanservjs: Refreshing state... [id=b601ff9f-0e67-49e4-b5a3-887c02d5b8f1]
module.authentik.authentik_outpost.goldilocks: Refreshing state... [id=be9fb3d8-c307-4c82-87b6-7718940128db]
module.authentik.authentik_application.goldilocks: Refreshing state... [id=goldilocks]
module.authentik.authentik_application.traefik: Refreshing state... [id=traefik]
module.authentik.authentik_outpost.traefik: Refreshing state... [id=fa02cacf-8651-4786-91c6-0afb600950ec]
module.authentik.authentik_application.esphome: Refreshing state... [id=esphome]
module.authentik.authentik_outpost.esphome: Refreshing state... [id=760c4360-ab7b-4bfd-bf6f-af085f11b0e9]
module.authentik.authentik_application.alertmanager: Refreshing state... [id=alertmanager]
module.authentik.authentik_outpost.alertmanager: Refreshing state... [id=ba4b0344-7bdd-4267-b509-ce5f30272558]
module.authentik.kubectl_manifest.ingress_scanservjs: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-scanservjs]
module.authentik.kubectl_manifest.ingress_longhorn: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-longhorn]
module.authentik.kubectl_manifest.ingress_prometheus: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-prometheus]
module.authentik.kubectl_manifest.ingress_goldilocks: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-goldilocks]
module.authentik.kubectl_manifest.ingress_traefik: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-traefik]
module.authentik.kubectl_manifest.ingress_esphome: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-esphome]
module.authentik.kubectl_manifest.ingress_alertmanager: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-alertmanager]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.authentik.authentik_application.alertmanager has been deleted
  - resource "authentik_application" "alertmanager" {
      - id                 = "alertmanager" -> null
      - meta_description   = "alertmanager web ui" -> null
      - meta_icon          = "fa://fa-bell" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "alertmanager" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 7 -> null
      - slug               = "alertmanager" -> null
      - uuid               = "b72fa1c8-d7fe-4996-b373-636f5a07c7d0" -> null
    }

  # module.authentik.authentik_application.esphome has been deleted
  - resource "authentik_application" "esphome" {
      - id                 = "esphome" -> null
      - meta_description   = "esphome dashboard" -> null
      - meta_icon          = "https://esphome.io/_static/logo-text.svg" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "esphome" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 4 -> null
      - slug               = "esphome" -> null
      - uuid               = "a24f16aa-c031-4cf2-94e5-8fb596b1227a" -> null
    }

  # module.authentik.authentik_application.goldilocks has been deleted
  - resource "authentik_application" "goldilocks" {
      - id                 = "goldilocks" -> null
      - meta_description   = "goldilocks web ui" -> null
      - meta_icon          = "fa://fa-flask" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "goldilocks" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 2 -> null
      - slug               = "goldilocks" -> null
      - uuid               = "f7a7318f-5446-463c-a5c9-c37c567c1816" -> null
    }

  # module.authentik.authentik_application.longhorn has been deleted
  - resource "authentik_application" "longhorn" {
      - id                 = "longhorn" -> null
      - meta_description   = "longhorn storage ui" -> null
      - meta_icon          = "fa://fa-hdd" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "longhorn" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 1 -> null
      - slug               = "longhorn" -> null
      - uuid               = "b2952b31-989e-4621-a6b7-32839b75d0c4" -> null
    }

  # module.authentik.authentik_application.prometheus has been deleted
  - resource "authentik_application" "prometheus" {
      - id                 = "prometheus" -> null
      - meta_description   = "prometheus observability" -> null
      - meta_icon          = "fa://fa-clipboard-check" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "prometheus" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 6 -> null
      - slug               = "prometheus" -> null
      - uuid               = "d3038fc0-642d-44b3-b290-28a46427521a" -> null
    }

  # module.authentik.authentik_application.scanservjs has been deleted
  - resource "authentik_application" "scanservjs" {
      - id                 = "scanservjs" -> null
      - meta_description   = "scanservjs application" -> null
      - meta_icon          = "https://www.iconhot.com/icon/png/token/256/scanner-7.png" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "scanservjs" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 3 -> null
      - slug               = "scanservjs" -> null
      - uuid               = "eaa2d9d3-9b57-4019-b8c0-6071ddcf5043" -> null
    }

  # module.authentik.authentik_application.traefik has been deleted
  - resource "authentik_application" "traefik" {
      - id                 = "traefik" -> null
      - meta_description   = "traefik dashboard" -> null
      - meta_icon          = "fa://fa-globe" -> null
      - meta_launch_url    = (sensitive) -> null
      - meta_publisher     = (sensitive) -> null
      - name               = "traefik" -> null
      - policy_engine_mode = "any" -> null
      - protocol_provider  = 5 -> null
      - slug               = "traefik" -> null
      - uuid               = "2ee3a2ca-dd92-47f4-b136-2c6ce07b86ee" -> null
    }

  # module.authentik.authentik_outpost.alertmanager has been deleted
  - resource "authentik_outpost" "alertmanager" {
      - config             = (sensitive) -> null
      - id                 = "ba4b0344-7bdd-4267-b509-ce5f30272558" -> null
      - name               = "alertmanager" -> null
      - protocol_providers = [
          - 7,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.esphome has been deleted
  - resource "authentik_outpost" "esphome" {
      - config             = (sensitive) -> null
      - id                 = "760c4360-ab7b-4bfd-bf6f-af085f11b0e9" -> null
      - name               = "esphome" -> null
      - protocol_providers = [
          - 4,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.goldilocks has been deleted
  - resource "authentik_outpost" "goldilocks" {
      - config             = (sensitive) -> null
      - id                 = "be9fb3d8-c307-4c82-87b6-7718940128db" -> null
      - name               = "goldilocks" -> null
      - protocol_providers = [
          - 2,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.longhorn has been deleted
  - resource "authentik_outpost" "longhorn" {
      - config             = (sensitive) -> null
      - id                 = "66c19be6-ec00-4712-947f-be7de1d01cc1" -> null
      - name               = "longhorn" -> null
      - protocol_providers = [
          - 1,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.prometheus has been deleted
  - resource "authentik_outpost" "prometheus" {
      - config             = (sensitive) -> null
      - id                 = "32a759b7-f2b9-4fe2-bebf-523300e4165f" -> null
      - name               = "prometheus" -> null
      - protocol_providers = [
          - 6,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.scanservjs has been deleted
  - resource "authentik_outpost" "scanservjs" {
      - config             = (sensitive) -> null
      - id                 = "b601ff9f-0e67-49e4-b5a3-887c02d5b8f1" -> null
      - name               = "scanservjs" -> null
      - protocol_providers = [
          - 3,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_outpost.traefik has been deleted
  - resource "authentik_outpost" "traefik" {
      - config             = (sensitive) -> null
      - id                 = "fa02cacf-8651-4786-91c6-0afb600950ec" -> null
      - name               = "traefik" -> null
      - protocol_providers = [
          - 5,
        ] -> null
      - service_connection = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - type               = "proxy" -> null
    }

  # module.authentik.authentik_provider_proxy.alertmanager has been deleted
  - resource "authentik_provider_proxy" "alertmanager" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "7" -> null
      - internal_host                 = "http://prometheus-alertmanager.observability.svc.cluster.local:9093" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "alertmanager" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.esphome has been deleted
  - resource "authentik_provider_proxy" "esphome" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "4" -> null
      - internal_host                 = "http://esphome.home.svc.cluster.local:6052" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "esphome" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.goldilocks has been deleted
  - resource "authentik_provider_proxy" "goldilocks" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "2" -> null
      - internal_host                 = "http://goldilocks-dashboard.observability.svc.cluster.local" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "goldilocks" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.longhorn has been deleted
  - resource "authentik_provider_proxy" "longhorn" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "1" -> null
      - internal_host                 = "http://longhorn-frontend.longhorn-system.svc.cluster.local" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "longhorn" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.prometheus has been deleted
  - resource "authentik_provider_proxy" "prometheus" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "6" -> null
      - internal_host                 = "http://prometheus-prometheus.observability.svc.cluster.local:9090" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "prometheus" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.scanservjs has been deleted
  - resource "authentik_provider_proxy" "scanservjs" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "3" -> null
      - internal_host                 = "http://scanservjs.hardware.svc.cluster.local:8080" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "scanservjs" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_provider_proxy.traefik has been deleted
  - resource "authentik_provider_proxy" "traefik" {
      - authorization_flow            = "a3b32e33-8d23-4ec9-aedb-d24cade34ae5" -> null
      - basic_auth_enabled            = false -> null
      - basic_auth_password_attribute = "" -> null
      - basic_auth_username_attribute = "" -> null
      - cookie_domain                 = "" -> null
      - external_host                 = (sensitive) -> null
      - id                            = "5" -> null
      - internal_host                 = "http://traefik.networking.svc.cluster.local:9000" -> null
      - internal_host_ssl_validation  = true -> null
      - mode                          = "proxy" -> null
      - name                          = "traefik" -> null
      - skip_path_regex               = "" -> null
    }

  # module.authentik.authentik_service_connection_kubernetes.local has been deleted
  - resource "authentik_service_connection_kubernetes" "local" {
      - id         = "da9c1c87-b5d6-48eb-9f37-91fd0a1892b5" -> null
      - kubeconfig = jsonencode({}) -> null
      - local      = true -> null
      - name       = "Local Kubernetes Cluster" -> null
    }

  # module.authentik.authentik_source_oauth.google has been deleted
  - resource "authentik_source_oauth" "google" {
      - access_token_url    = "" -> null
      - additional_scopes   = "" -> null
      - authentication_flow = "a2ed5eb6-41de-44c5-92cb-e1a8c70e69c1" -> null
      - authorization_url   = "" -> null
      - callback_uri        = "https://authentik.techtales.io/source/oauth/callback/google/" -> null
      - consumer_key        = (sensitive) -> null
      - consumer_secret     = (sensitive value)
      - enabled             = true -> null
      - enrollment_flow     = "1d78fe66-4311-4670-85c7-ac0a68fea925" -> null
      - id                  = "google" -> null
      - name                = "Google" -> null
      - policy_engine_mode  = "any" -> null
      - profile_url         = "" -> null
      - provider_type       = "google" -> null
      - request_token_url   = "" -> null
      - slug                = "google" -> null
      - user_matching_mode  = "identifier" -> null
      - uuid                = "678cccce-9acc-475e-9fd0-1e3a852467a9" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to
these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.authentik.authentik_application.alertmanager will be created
  + resource "authentik_application" "alertmanager" {
      + id                 = (known after apply)
      + meta_description   = "alertmanager web ui"
      + meta_icon          = "fa://fa-bell"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "alertmanager"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "alertmanager"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.esphome will be created
  + resource "authentik_application" "esphome" {
      + id                 = (known after apply)
      + meta_description   = "esphome dashboard"
      + meta_icon          = "https://esphome.io/_static/logo-text.svg"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "esphome"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "esphome"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.goldilocks will be created
  + resource "authentik_application" "goldilocks" {
      + id                 = (known after apply)
      + meta_description   = "goldilocks web ui"
      + meta_icon          = "fa://fa-flask"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "goldilocks"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "goldilocks"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.longhorn will be created
  + resource "authentik_application" "longhorn" {
      + id                 = (known after apply)
      + meta_description   = "longhorn storage ui"
      + meta_icon          = "fa://fa-hdd"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "longhorn"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "longhorn"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.prometheus will be created
  + resource "authentik_application" "prometheus" {
      + id                 = (known after apply)
      + meta_description   = "prometheus observability"
      + meta_icon          = "fa://fa-clipboard-check"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "prometheus"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "prometheus"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.scanservjs will be created
  + resource "authentik_application" "scanservjs" {
      + id                 = (known after apply)
      + meta_description   = "scanservjs application"
      + meta_icon          = "https://www.iconhot.com/icon/png/token/256/scanner-7.png"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "scanservjs"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "scanservjs"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_application.traefik will be created
  + resource "authentik_application" "traefik" {
      + id                 = (known after apply)
      + meta_description   = "traefik dashboard"
      + meta_icon          = "fa://fa-globe"
      + meta_launch_url    = (sensitive)
      + meta_publisher     = (sensitive)
      + name               = "traefik"
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "traefik"
      + uuid               = (known after apply)
    }

  # module.authentik.authentik_outpost.alertmanager will be created
  + resource "authentik_outpost" "alertmanager" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "alertmanager"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.esphome will be created
  + resource "authentik_outpost" "esphome" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "esphome"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.goldilocks will be created
  + resource "authentik_outpost" "goldilocks" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "goldilocks"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.longhorn will be created
  + resource "authentik_outpost" "longhorn" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "longhorn"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.prometheus will be created
  + resource "authentik_outpost" "prometheus" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "prometheus"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.scanservjs will be created
  + resource "authentik_outpost" "scanservjs" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "scanservjs"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_outpost.traefik will be created
  + resource "authentik_outpost" "traefik" {
      + config             = (sensitive)
      + id                 = (known after apply)
      + name               = "traefik"
      + protocol_providers = (known after apply)
      + service_connection = (known after apply)
      + type               = "proxy"
    }

  # module.authentik.authentik_provider_proxy.alertmanager will be created
  + resource "authentik_provider_proxy" "alertmanager" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://prometheus-alertmanager.observability.svc.cluster.local:9093"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "alertmanager"
    }

  # module.authentik.authentik_provider_proxy.esphome will be created
  + resource "authentik_provider_proxy" "esphome" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://esphome.home.svc.cluster.local:6052"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "esphome"
    }

  # module.authentik.authentik_provider_proxy.goldilocks will be created
  + resource "authentik_provider_proxy" "goldilocks" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://goldilocks-dashboard.observability.svc.cluster.local"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "goldilocks"
    }

  # module.authentik.authentik_provider_proxy.longhorn will be created
  + resource "authentik_provider_proxy" "longhorn" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://longhorn-frontend.longhorn-system.svc.cluster.local"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "longhorn"
    }

  # module.authentik.authentik_provider_proxy.prometheus will be created
  + resource "authentik_provider_proxy" "prometheus" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://prometheus-prometheus.observability.svc.cluster.local:9090"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "prometheus"
    }

  # module.authentik.authentik_provider_proxy.scanservjs will be created
  + resource "authentik_provider_proxy" "scanservjs" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://scanservjs.hardware.svc.cluster.local:8080"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "scanservjs"
    }

  # module.authentik.authentik_provider_proxy.traefik will be created
  + resource "authentik_provider_proxy" "traefik" {
      + authorization_flow           = "f5caabc6-4b57-4e52-b3cf-aa77f76175b7"
      + basic_auth_enabled           = false
      + external_host                = (sensitive)
      + id                           = (known after apply)
      + internal_host                = "http://traefik.networking.svc.cluster.local:9000"
      + internal_host_ssl_validation = true
      + mode                         = "proxy"
      + name                         = "traefik"
    }

  # module.authentik.authentik_service_connection_kubernetes.local will be created
  + resource "authentik_service_connection_kubernetes" "local" {
      + id         = (known after apply)
      + kubeconfig = jsonencode({})
      + local      = true
      + name       = "Local Kubernetes Cluster"
    }

  # module.authentik.authentik_source_oauth.google will be created
  + resource "authentik_source_oauth" "google" {
      + authentication_flow = "343a4717-d43d-45cf-a1f2-a15009279823"
      + callback_uri        = (known after apply)
      + consumer_key        = (sensitive)
      + consumer_secret     = (sensitive value)
      + enabled             = true
      + enrollment_flow     = "6e73f606-a730-4c78-96a2-dbe50cf081c8"
      + id                  = (known after apply)
      + name                = "Google"
      + policy_engine_mode  = "any"
      + provider_type       = "google"
      + slug                = "google"
      + user_matching_mode  = "identifier"
      + uuid                = (known after apply)
    }

  # module.authentik.kubectl_manifest.ingress_alertmanager will be updated in-place
  ~ resource "kubectl_manifest" "ingress_alertmanager" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-alertmanager"
        name                    = "ak-outpost-alertmanager"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_esphome will be updated in-place
  ~ resource "kubectl_manifest" "ingress_esphome" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-esphome"
        name                    = "ak-outpost-esphome"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_goldilocks will be updated in-place
  ~ resource "kubectl_manifest" "ingress_goldilocks" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-goldilocks"
        name                    = "ak-outpost-goldilocks"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_longhorn will be updated in-place
  ~ resource "kubectl_manifest" "ingress_longhorn" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-longhorn"
        name                    = "ak-outpost-longhorn"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_prometheus will be updated in-place
  ~ resource "kubectl_manifest" "ingress_prometheus" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-prometheus"
        name                    = "ak-outpost-prometheus"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_scanservjs will be updated in-place
  ~ resource "kubectl_manifest" "ingress_scanservjs" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-scanservjs"
        name                    = "ak-outpost-scanservjs"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.authentik.kubectl_manifest.ingress_traefik will be updated in-place
  ~ resource "kubectl_manifest" "ingress_traefik" {
        id                      = "/apis/networking.k8s.io/v1/namespaces/authentik-system/ingresses/ak-outpost-traefik"
        name                    = "ak-outpost-traefik"
      ~ yaml_body               = (sensitive value)
        # (12 unchanged attributes hidden)
    }

Plan: 23 to add, 7 to change, 0 to destroy.
```